In [77]:
#import dependencies 
import pandas as pd

In [78]:
#create a path for file
school_path = "/Users/kscomputer/Desktop/PyCitySchools/pandas-challenge/Resources/students_complete.csv"
district_path = "/Users/kscomputer/Desktop/PyCitySchools/pandas-challenge/Resources/schools_complete.csv"

In [79]:
#read district_path to a dataframe and get a snapshot
district_charter_df = pd.read_csv(district_path)

district_charter_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [179]:
#read school_path to a dataframe and get a snapshot of data
school_all_df = pd.read_csv(school_path)

school_all_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [180]:
#merged school_all and district_charter dfs to one dataframe on 'school name' 
merged_df = pd.merge(school_all_df,district_charter_df, on='school_name')

merged_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [ ]:
#Start of District Summary Creation

In [82]:
#find schools that are only in district. Remove Charter. 
district_size_df = district_charter_df.loc[district_charter_df['type']=='District',:]

district_size_df.head()

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
3           3  Hernandez High School  District  4635  3022020
7           7     Bailey High School  District  4976  3124928
11         11  Rodriguez High School  District  3999  2547363

In [83]:
#find lenth of school id to determine how many schools are in district
district_size_count = district_size_df['School ID']

district_size= len(district_size_count)

district_size

7

In [84]:
#find sum of students in the district
district_student_sum = district_size_df['size'].sum()

district_student_sum

26976

In [85]:
#find sum of budget for district
district_budget_sum = district_size_df['budget'].sum()

district_budget_sum

17347923

In [86]:
#inner merge on district_size and school_all to make calculations for average math score,reading, and percent
math_reading_df = pd.merge(district_size_df, school_all_df[['reading_score','math_score','school_name']], on='school_name')

math_reading_df

,School ID,school_name,type,size,budget,reading_score,math_score
0,0,Huang High School,District,2917,1910635,66,79
1,0,Huang High School,District,2917,1910635,94,61
2,0,Huang High School,District,2917,1910635,90,60
3,0,Huang High School,District,2917,1910635,67,58
4,0,Huang High School,District,2917,1910635,97,84
...,...,...,...,...,...,...,...
26971,13,Ford High School,District,2739,1763916,63,59
26972,13,Ford High School,District,2739,1763916,94,80
26973,13,Ford High School,District,2739,1763916,91,66
26974,13,Ford High School,District,2739,1763916,75,70
26975,13,Ford High School,District,2739,1763916,76,84

In [87]:
#merge dataframe math_reading is good. 
math_reading_df['school_name'].value_counts()

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Name: school_name, dtype: int64

In [88]:
#avaerage math for district 
average_math_district = math_reading_df['math_score'].mean()

average_math_district

76.98702550415184

In [89]:
#average reading for district
average_reading_district = math_reading_df['reading_score'].mean()

average_reading_district

80.96248517200475

In [90]:
#percent passing math district
passing_math_district = (math_reading_df['math_score']>=70).sum()

percent_math_district = (passing_math_district/26976)*100

percent_math_district

66.51838671411625

In [91]:
#percent passing reading
passing_reading_district = (math_reading_df['reading_score']>=70).sum()

percent_reading_district = (passing_reading_district/26976)*100 

percent_reading_district

80.90524911032028

In [92]:
#percent passing math and reading
passing_reading_math_district = ((math_reading_df['reading_score']>=70)& (math_reading_df['math_score']>=70)).sum()

percent_reading_math_district = (passing_reading_math_district/26976)*100

percent_reading_math_district

53.695877817319094

In [93]:
#summary table for district
summary_district = {'Total Schools':[district_size],
                      'Total Students':[district_student_sum],
                      'Total Budget':[district_budget_sum],
                      'Average Math Score':[average_math_district],
                      'Average Reading Score':[average_reading_district],
                      '% Passing Math': [percent_math_district],
                      '% Passing Reading':[percent_reading_district],
                      '% Overall Passing':[percent_reading_math_district]}

summary_district_df = pd.DataFrame(data = summary_district)
summary_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,7,26976,17347923,76.987026,80.962485,66.518387,80.905249,53.695878

In [166]:
#taking merged_df and re organizing for the information we need beginning of school summary
school_df = merged_df[['school_name','type','size','budget','math_score','reading_score']]

school_df

              school_name      type  size   budget  math_score  reading_score
0       Huang High School  District  2917  1910635          79             66
1       Huang High School  District  2917  1910635          61             94
2       Huang High School  District  2917  1910635          60             90
3       Huang High School  District  2917  1910635          58             67
4       Huang High School  District  2917  1910635          84             97
...                   ...       ...   ...      ...         ...            ...
39165  Thomas High School   Charter  1635  1043130          90             99
39166  Thomas High School   Charter  1635  1043130          70             95
39167  Thomas High School   Charter  1635  1043130          84             73
39168  Thomas High School   Charter  1635  1043130          90             99
39169  Thomas High School   Charter  1635  1043130          75             95

[39170 rows x 6 columns]

In [167]:
#grouping school name and typ to then take and find mean
math_reading = school_df.groupby(['school_name','type'])

In [171]:
#updated data frame created with mean for math_score and reading_score
mr_df = math_reading.mean()

In [172]:
#make sure data displays how I think
mr_df.head()

                                 size     budget  math_score  reading_score
school_name          type
Bailey High School   District  4976.0  3124928.0   77.048432      81.033963
Cabrera High School  Charter   1858.0  1081356.0   83.061895      83.975780
Figueroa High School District  2949.0  1884411.0   76.711767      81.158020
Ford High School     District  2739.0  1763916.0   77.102592      80.746258
Griffin High School  Charter   1468.0   917500.0   83.351499      83.816757

In [175]:
#ask Meili about isolating per student data and adding as column to mr_df
#find the per student budget to later add to mr_df data frame
per_student = mr_df['budget']/mr_df['size']

per_student

school_name            type
Bailey High School     District    628.0
Cabrera High School    Charter     582.0
Figueroa High School   District    639.0
Ford High School       District    644.0
Griffin High School    Charter     625.0
Hernandez High School  District    652.0
Holden High School     Charter     581.0
Huang High School      District    655.0
Johnson High School    District    650.0
Pena High School       Charter     609.0
Rodriguez High School  District    637.0
Shelton High School    Charter     600.0
Thomas High School     Charter     638.0
Wilson High School     Charter     578.0
Wright High School     Charter     583.0
dtype: float64

In [193]:
#need to use school_df to get the students that passed. using the mr_df is not an option because has all data consolidated
#print to make sure logic is still working
math_s = school_df.loc[school_df['math_score']>=70]

math_s.head()

         school_name      type  size   budget  math_score  reading_score
0  Huang High School  District  2917  1910635          79             66
4  Huang High School  District  2917  1910635          84             97
5  Huang High School  District  2917  1910635          94             94
6  Huang High School  District  2917  1910635          80             82
8  Huang High School  District  2917  1910635          87             95

In [188]:
#logic worked not need to take percent_math_s and groupby school
math_group = math_s.groupby(['school_name'])

In [195]:
reading_s = school_df.loc[school_df['reading_score']>=70]

reading_s.head()

         school_name      type  size   budget  math_score  reading_score
1  Huang High School  District  2917  1910635          61             94
2  Huang High School  District  2917  1910635          60             90
4  Huang High School  District  2917  1910635          84             97
5  Huang High School  District  2917  1910635          94             94
6  Huang High School  District  2917  1910635          80             82

In [ ]:
reading_group = reading_s.groupby(['school_name'])

In [197]:
#indivduals who meet criteria of passing reading and math
read_math_s = school_df.loc[(school_df['reading_score']>=70) & (school_df['math_score']>=70)]

read_math_s

              school_name      type  size   budget  math_score  reading_score
4       Huang High School  District  2917  1910635          84             97
5       Huang High School  District  2917  1910635          94             94
6       Huang High School  District  2917  1910635          80             82
8       Huang High School  District  2917  1910635          87             95
9       Huang High School  District  2917  1910635          84             96
...                   ...       ...   ...      ...         ...            ...
39165  Thomas High School   Charter  1635  1043130          90             99
39166  Thomas High School   Charter  1635  1043130          70             95
39167  Thomas High School   Charter  1635  1043130          84             73
39168  Thomas High School   Charter  1635  1043130          90             99
39169  Thomas High School   Charter  1635  1043130          75             95

[25528 rows x 6 columns]

In [199]:
#grouping reading and math together by school name
read_math_group = read_math_s.groupby(['school_name'])

In [200]:
#Ask Meili about this step
read_math_p = (read_math_group/39170)*100

TypeError: unsupported operand type(s) for /: 'DataFrameGroupBy' and 'int'

In [94]:
#here to make percent and average easier
schools_name = merged_df.set_index('school_name').groupby(['school_name'])

In [95]:
school_names = district_charter_df['school_name']

school_names

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
Name: school_name, dtype: object

In [96]:
schools_type = merged_df.set_index('school_name')['type'].value_counts()

schools_type

District    26976
Charter     12194
Name: type, dtype: int64

In [97]:
per_school_counts = merged_df['school_name'].value_counts()

per_school_counts

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [98]:
schools_budget = merged_df['budget'].value_counts()

schools_budget

3124928    4976
3094650    4761
3022020    4635
2547363    3999
1884411    2949
1910635    2917
1763916    2739
1319574    2283
1081356    1858
1049400    1800
1056600    1761
1043130    1635
917500     1468
585858      962
248087      427
Name: budget, dtype: int64

In [99]:
schools_per_student_budget = district_charter_df.set_index('school_name')['budget']/district_charter_df.set_index('school_name')['size']

schools_per_student_budget

school_name
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
Wilson High School       578.0
Cabrera High School      582.0
Bailey High School       628.0
Holden High School       581.0
Pena High School         609.0
Wright High School       583.0
Rodriguez High School    637.0
Johnson High School      650.0
Ford High School         644.0
Thomas High School       638.0
dtype: float64

In [100]:
#math score average per school
average_math_score = schools_name['math_score'].mean()

average_math_score

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [101]:
average_reading_score = schools_name['reading_score'].mean()

average_reading_score

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [152]:
#math score by grade step 1 make a smaller data frame
grades_math_df = school_all_df[['grade','school_name','math_score']]

grades_math_df.head()

  grade        school_name  math_score
0   9th  Huang High School          79
1  12th  Huang High School          61
2  12th  Huang High School          60
3  12th  Huang High School          58
4   9th  Huang High School          84

In [158]:
#math score by grade step 2 group 'school name' and 'grade' together to isolate 'math score'
math_test = grades_math_df.groupby(['school_name','grade'])

In [159]:
#math score by grade step 3 take 'math_test'and .mean
math_test.mean()

                             math_score
school_name           grade
Bailey High School    10th    76.996772
                      11th    77.515588
                      12th    76.492218
                      9th     77.083676
Cabrera High School   10th    83.154506
                      11th    82.765560
                      12th    83.277487
                      9th     83.094697
Figueroa High School  10th    76.539974
                      11th    76.884344
                      12th    77.151369
                      9th     76.403037
Ford High School      10th    77.672316
                      11th    76.918058
                      12th    76.179963
                      9th     77.361345
Griffin High School   10th    84.229064
                      11th    83.842105
                      12th    83.356164
                      9th     82.044010
Hernandez High School 10th    77.337408
                      11th    77.136029
                      12th    77.186567
                      9th     77.438495
Holden High School    10th    83.429825
                      11th    85.000000
                      12th    82.855422
                      9th     83.787402
Huang High School     10th    75.908735
                      11th    76.446602
                      12th    77.225641
                      9th     77.027251
Johnson High School   10th    76.691117
                      11th    77.491653
                      12th    76.863248
                      9th     77.187857
Pena High School      10th    83.372000
                      11th    84.328125
                      12th    84.121547
                      9th     83.625455
Rodriguez High School 10th    76.612500
                      11th    76.395626
                      12th    77.690748
                      9th     76.859966
Shelton High School   10th    82.917411
                      11th    83.383495
                      12th    83.778976
                      9th     83.420755
Thomas High School    10th    83.087886
                      11th    83.498795
                      12th    83.497041
                      9th     83.590022
Wilson High School    10th    83.724422
                      11th    83.195326
                      12th    83.035794
                      9th     83.085578
Wright High School    10th    84.010288
                      11th    83.836782
                      12th    83.644986
                      9th     83.264706

In [177]:
#reading score by grade step 1 make a smaller data frame
grades_reading_df = school_all_df[['grade','school_name','reading_score']]
                                   
grades_reading_df.head()

  grade        school_name  reading_score
0   9th  Huang High School             66
1  12th  Huang High School             94
2  12th  Huang High School             90
3  12th  Huang High School             67
4   9th  Huang High School             97

In [178]:
#math score by grade step 2 group 'school name' and 'grade' together to isolate 'reading score'
reading_test = grades_reading_df.groupby(['school_name','grade'])

In [162]:
#math score by grade step 3 take 'reading_test'and .mean
reading_test.mean()

                             reading_score
school_name           grade
Bailey High School    10th       80.907183
                      11th       80.945643
                      12th       80.912451
                      9th        81.303155
Cabrera High School   10th       84.253219
                      11th       83.788382
                      12th       84.287958
                      9th        83.676136
Figueroa High School  10th       81.408912
                      11th       80.640339
                      12th       81.384863
                      9th        81.198598
Ford High School      10th       81.262712
                      11th       80.403642
                      12th       80.662338
                      9th        80.632653
Griffin High School   10th       83.706897
                      11th       84.288089
                      12th       84.013699
                      9th        83.369193
Hernandez High School 10th       80.660147
                      11th       81.396140
                      12th       80.857143
                      9th        80.866860
Holden High School    10th       83.324561
                      11th       83.815534
                      12th       84.698795
                      9th        83.677165
Huang High School     10th       81.512386
                      11th       81.417476
                      12th       80.305983
                      9th        81.290284
Johnson High School   10th       80.773431
                      11th       80.616027
                      12th       81.227564
                      9th        81.260714
Pena High School      10th       83.612000
                      11th       84.335938
                      12th       84.591160
                      9th        83.807273
Rodriguez High School 10th       80.629808
                      11th       80.864811
                      12th       80.376426
                      9th        80.993127
Shelton High School   10th       83.441964
                      11th       84.373786
                      12th       82.781671
                      9th        84.122642
Thomas High School    10th       84.254157
                      11th       83.585542
                      12th       83.831361
                      9th        83.728850
Wilson High School    10th       84.021452
                      11th       83.764608
                      12th       84.317673
                      9th        83.939778
Wright High School    10th       83.812757
                      11th       84.156322
                      12th       84.073171
                      9th        83.833333